{
  "tool_name": "Growing Degree Calculator",
  "tool_description": "Calculates accumulated growing degree days (GDD) and heat units for crop development based on temperature thresholds and crop requirements.",
  "parameters": {
    "daily_min_temps": {
      "type": "array",
      "required": true,
      "description": "Array of daily minimum temperatures in Celsius",
      "items": {
        "type": "number"
      }
    },
    "daily_max_temps": {
      "type": "array",
      "required": true,
      "description": "Array of daily maximum temperatures in Celsius",
      "items": {
        "type": "number"
      }
    },
    "base_temperature": {
      "type": "number",
      "required": true,
      "description": "Base temperature threshold for crop growth in Celsius"
    },
    "upper_threshold": {
      "type": "number",
      "required": false,
      "description": "Upper temperature threshold above which growth stops",
      "default": "35"
    }
  },
  "error_messages": [
    "Temperature array mismatch: Daily minimum and maximum temperature arrays must have the same length.",
    "Invalid temperature values: Maximum temperatures must be greater than or equal to minimum temperatures.",
    "Invalid base temperature: Base temperature must be between 0 and 25°C.",
    "Invalid upper threshold: Upper threshold must be greater than base temperature and less than 50°C.",
    "Insufficient data: Need at least 1 day of temperature data."
  ],
  "usage": "Provide arrays of daily minimum and maximum temperatures along with crop-specific base temperature. Optional upper threshold caps excessive heat. Returns cumulative growing degree days.",
  "output_details": {
    "daily_gdd": {
      "type": "array",
      "items": {
        "type": "number"
      },
      "description": "Growing degree days for each day"
    },
    "cumulative_gdd": {
      "type": "number",
      "description": "Total accumulated growing degree days"
    },
    "average_daily_gdd": {
      "type": "number",
      "description": "Average GDD per day over the period"
    },
    "effective_growing_days": {
      "type": "integer",
      "description": "Number of days with positive GDD accumulation"
    }
  }
}