{
  "tool_name": "Legal Document Verifier",
  "tool_description": "Verifies the authenticity and current status of legal documents related to property ownership, liens, easements, and encumbrances through official record checks.",
  "parameters": {
    "document_references": {
      "type": "array",
      "required": true,
      "description": "Array of legal document references or recording numbers",
      "items": {
        "type": "string"
      },
      "minItems": 1,
      "maxItems": 50
    },
    "county_recorder_office": {
      "type": "string",
      "required": true,
      "description": "Name of the county recorder's office or jurisdiction"
    },
    "state": {
      "type": "string",
      "required": true,
      "description": "State where documents are recorded (two-letter abbreviation)"
    },
    "document_types": {
      "type": "array",
      "required": false,
      "description": "Types of documents to verify (deed, mortgage, lien, easement, etc.)",
      "items": {
        "type": "string"
      },
      "default": null
    },
    "verification_depth": {
      "type": "string",
      "required": false,
      "description": "Level of verification: basic, standard, or comprehensive",
      "default": "standard"
    }
  },
  "error_messages": [
    "Invalid document reference: One or more document references are not found in official records.",
    "Recorder office not accessible: Cannot access the specified county recorder's office database.",
    "Invalid state code: State must be a valid two-letter abbreviation.",
    "Document type not supported: One or more specified document types are not recognized.",
    "Verification level invalid: Verification depth must be one of [basic, standard, comprehensive].",
    "Too many documents: Maximum of 50 document references can be processed at once."
  ],
  "usage": "Provide document recording numbers or references along with the county and state information. Specify document types and verification level for targeted verification.",
  "output_details": {
    "verification_status": {
      "type": "string",
      "description": "Overall verification status of submitted documents"
    },
    "verified_documents": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "List of successfully verified documents with details"
    },
    "unverified_documents": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "List of documents that could not be verified with reasons"
    },
    "document_status": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Current status of each document (active, satisfied, expired, etc.)"
    },
    "last_verification_date": {
      "type": "string",
      "description": "Date and time when verification was completed",
      "format": "date-time"
    }
  }
}