{
  "tool_name": "Market Condition Assessor",
  "tool_description": "Analyzes current market conditions including supply, demand, pricing trends, and economic factors that may impact property values in a specific area and timeframe.",
  "parameters": {
    "location": {
      "type": "string",
      "required": true,
      "description": "Geographic area for market analysis (city, zip code, or neighborhood)"
    },
    "property_type": {
      "type": "string",
      "required": true,
      "description": "Property type for market analysis focus"
    },
    "analysis_period_months": {
      "type": "integer",
      "required": false,
      "description": "Number of months to analyze for trends",
      "default": 12
    },
    "include_foreclosures": {
      "type": "boolean",
      "required": false,
      "description": "Include foreclosure sales in market analysis",
      "default": false
    },
    "market_segments": {
      "type": "array",
      "required": false,
      "description": "Specific market segments to analyze (luxury, starter, mid-range, etc.)",
      "items": {
        "type": "string"
      },
      "default": null
    }
  },
  "error_messages": [
    "Invalid location: The specified location cannot be found or is not supported for market analysis.",
    "Invalid property type: Property type must be one of the supported categories.",
    "Analysis period out of range: Analysis period must be between 3 and 60 months.",
    "Insufficient market data: Not enough recent sales data available for reliable market analysis.",
    "Invalid market segment: One or more specified market segments are not recognized."
  ],
  "usage": "Specify the location and property type for market analysis. Optionally set the analysis timeframe and market segments to focus the assessment on relevant market conditions.",
  "output_details": {
    "market_trend": {
      "type": "string",
      "description": "Overall market trend direction (appreciating, stable, declining)"
    },
    "average_days_on_market": {
      "type": "integer",
      "description": "Average number of days properties stay on the market"
    },
    "inventory_levels": {
      "type": "string",
      "description": "Current inventory levels (low, balanced, high)"
    },
    "price_trend_percentage": {
      "type": "number",
      "description": "Percentage change in average prices over analysis period"
    },
    "absorption_rate": {
      "type": "number",
      "description": "Rate at which available properties are sold (months of supply)"
    },
    "market_factors": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Key economic and market factors influencing property values"
    }
  }
}