{
  "tool_name": "Photo Documentation Manager",
  "tool_description": "Organizes, categorizes, and validates property photographs with metadata extraction, quality assessment, and compliance checking for appraisal documentation standards.",
  "parameters": {
    "photo_paths": {
      "type": "array",
      "required": true,
      "description": "Array of file paths to property photographs",
      "items": {
        "type": "string"
      },
      "minItems": 1,
      "maxItems": 100
    },
    "property_address": {
      "type": "string",
      "required": true,
      "description": "Address of the photographed property for organization"
    },
    "required_categories": {
      "type": "array",
      "required": false,
      "description": "Required photo categories (exterior_front, interior_kitchen, etc.)",
      "items": {
        "type": "string"
      },
      "default": null
    },
    "minimum_resolution": {
      "type": "integer",
      "required": false,
      "description": "Minimum acceptable image resolution in pixels",
      "default": 1024
    },
    "auto_categorize": {
      "type": "boolean",
      "required": false,
      "description": "Automatically categorize photos based on content analysis",
      "default": true
    },
    "extract_metadata": {
      "type": "boolean",
      "required": false,
      "description": "Extract and validate photo metadata including date, GPS, camera info",
      "default": true
    },
    "quality_check": {
      "type": "boolean",
      "required": false,
      "description": "Perform quality assessment for clarity, lighting, and composition",
      "default": true
    }
  },
  "error_messages": [
    "Photos not found: One or more specified photo paths do not exist or are inaccessible.",
    "Invalid file format: All photos must be in supported formats (JPEG, PNG, TIFF).",
    "Resolution too low: One or more photos do not meet the minimum resolution requirement.",
    "Missing required categories: Photos for required categories are missing from the collection.",
    "Metadata extraction failed: Unable to extract metadata from one or more photos.",
    "Quality assessment failed: Photos do not meet minimum quality standards for appraisal documentation.",
    "Too many photos: Maximum of 100 photos can be processed at once."
  ],
  "usage": "Provide paths to property photos and the property address. Optionally specify required photo categories, quality standards, and processing options for comprehensive photo documentation.",
  "output_details": {
    "total_photos_processed": {
      "type": "integer",
      "description": "Number of photos successfully processed"
    },
    "photo_categories": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Categorized list of photos by type (exterior, interior, detail, etc.)"
    },
    "quality_summary": {
      "type": "string",
      "description": "Overall quality assessment of the photo collection"
    },
    "missing_categories": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "List of required photo categories that are missing"
    },
    "metadata_summary": {
      "type": "string",
      "description": "Summary of extracted metadata including date ranges and equipment used"
    },
    "compliance_status": {
      "type": "string",
      "description": "Compliance status with appraisal photo documentation standards"
    }
  }
}