{
  "tool_name": "Dark Web Monitor",
  "tool_description": "Monitors dark web forums, marketplaces, and communication channels for threat intelligence and criminal activity indicators.",
  "parameters": {
    "monitoring_keywords": {
      "type": "array",
      "required": true,
      "description": "Keywords to monitor for on dark web platforms",
      "items": {
        "type": "string"
      },
      "minItems": 1,
      "maxItems": 100
    },
    "platform_types": {
      "type": "array",
      "required": true,
      "description": "Types of dark web platforms to monitor (forums, markets, chat)",
      "items": {
        "type": "string"
      },
      "minItems": 1,
      "maxItems": 20
    },
    "monitoring_duration": {
      "type": "string",
      "required": true,
      "description": "Duration for continuous monitoring in ISO 8601 format",
      "format": "date-time"
    }
  },
  "error_messages": [
    "Invalid monitoring keywords: Keywords cannot contain prohibited characters",
    "Unsupported platform type: One or more platform types are not supported for monitoring",
    "Invalid monitoring duration: Duration must be a valid ISO 8601 time period",
    "Dark web access failed: Unable to establish connection to dark web platforms",
    "Authentication required: Some platforms require authentication credentials"
  ],
  "usage": "Provide monitoring keywords and platform types for dark web surveillance. Set monitoring duration based on intelligence requirements.",
  "output_details": {
    "detected_activities": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Suspicious or relevant activities detected on dark web platforms"
    },
    "platform_activity": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Activity levels and trends across monitored platforms"
    },
    "threat_indicators": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Threat indicators discovered through dark web monitoring"
    },
    "monitoring_summary": {
      "type": "string",
      "description": "Summary of dark web monitoring results and key findings"
    }
  }
}