{
  "tool_name": "Boot Media Creator",
  "tool_description": "Creates bootable installation media for operating system installation or recovery, supporting USB drives and optical media with proper formatting and file copying.",
  "parameters": {
    "os_iso_path": {
      "type": "string",
      "required": true,
      "description": "Path to the operating system ISO file"
    },
    "target_device": {
      "type": "string",
      "required": true,
      "description": "Target device path for bootable media creation"
    },
    "boot_mode": {
      "type": "string",
      "required": true,
      "description": "Boot mode: UEFI, Legacy, or Hybrid"
    },
    "file_system": {
      "type": "string",
      "required": false,
      "description": "File system format: FAT32, NTFS, or exFAT",
      "default": "FAT32"
    },
    "verify_media": {
      "type": "boolean",
      "required": false,
      "description": "Whether to verify bootable media after creation",
      "default": true
    }
  },
  "error_messages": [
    "ISO file not found: Ensure the specified ISO file path exists and is accessible.",
    "Invalid target device: Verify the target device is connected and accessible.",
    "Insufficient device capacity: Target device does not have enough space for the ISO file.",
    "Unsupported boot mode: Use one of [UEFI, Legacy, Hybrid].",
    "Invalid file system: Use one of [FAT32, NTFS, exFAT].",
    "Media creation failed: Unable to write bootable files to target device.",
    "Media verification failed: Created media failed bootability test."
  ],
  "usage": "Provide path to OS ISO file and target USB device. Choose boot_mode based on system requirements (UEFI for modern systems, Legacy for older systems, Hybrid for compatibility). FAT32 recommended for UEFI compatibility.",
  "output_details": {
    "media_size_gb": {
      "type": "number",
      "description": "Size of created bootable media in gigabytes"
    },
    "creation_time_minutes": {
      "type": "number",
      "description": "Time taken to create bootable media in minutes"
    },
    "boot_files_count": {
      "type": "integer",
      "description": "Number of boot files copied to media"
    },
    "verification_result": {
      "type": "string",
      "description": "Media verification and bootability test result"
    }
  }
}