{
  "tool_name": "Weather Station Connector",
  "tool_description": "Connects to weather stations and retrieves real-time and historical atmospheric measurements including wind speed, direction, temperature, pressure, and humidity.",
  "parameters": {
    "station_ids": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": true,
      "description": "List of weather station identifiers to query",
      "minItems": 1,
      "maxItems": 20
    },
    "start_time": {
      "type": "string",
      "required": true,
      "description": "Start datetime for data retrieval in ISO 8601 format",
      "format": "date-time"
    },
    "end_time": {
      "type": "string",
      "required": true,
      "description": "End datetime for data retrieval in ISO 8601 format",
      "format": "date-time"
    },
    "data_frequency": {
      "type": "string",
      "required": false,
      "description": "Data sampling frequency: 1min, 5min, 10min, 15min, 30min, 1hour",
      "default": "10min"
    }
  },
  "error_messages": [
    "Invalid station ID: One or more station IDs are not recognized or accessible. Verify station identifiers are correct and active.",
    "Time range error: End time must be after start time, and future dates are not allowed for historical data.",
    "Data frequency not supported: Use one of [1min, 5min, 10min, 15min, 30min, 1hour].",
    "Connection timeout: Unable to connect to weather station network. Check network connectivity and try again.",
    "Station offline: One or more requested stations are currently offline or not reporting data."
  ],
  "usage": "Provide valid station IDs and time range to retrieve weather measurements. Use appropriate data frequency based on forecasting needs - higher frequency for short-term predictions.",
  "output_details": {
    "timestamps": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "ISO 8601 formatted timestamps for each measurement"
    },
    "station_data": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Weather measurements formatted as comma-separated values for each timestamp"
    },
    "data_quality_flags": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Quality assessment flags for each measurement indicating reliability"
    },
    "retrieved_count": {
      "type": "integer",
      "description": "Total number of data points successfully retrieved"
    }
  }
}