{
  "tool_name": "Menu Template Creator",
  "tool_description": "Creates structured menu templates based on event type, cuisine preferences, and meal specifications, providing a foundation for detailed menu development.",
  "parameters": {
    "event_type": {
      "type": "string",
      "required": true,
      "description": "Type of event (wedding, corporate, birthday, conference, etc.)"
    },
    "cuisine_style": {
      "type": "string",
      "required": true,
      "description": "Primary cuisine style (italian, asian, american, mediterranean, fusion, etc.)"
    },
    "meal_types": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": true,
      "description": "Types of meals to include (breakfast, lunch, dinner, cocktail, dessert)",
      "minItems": 1,
      "maxItems": 5
    },
    "guest_count": {
      "type": "integer",
      "required": true,
      "description": "Expected number of guests"
    },
    "budget_tier": {
      "type": "string",
      "required": false,
      "description": "Budget category (economy, standard, premium, luxury)",
      "default": "standard"
    }
  },
  "error_messages": [
    "Invalid event type: Provide a recognized event type such as wedding, corporate, birthday, conference, or similar.",
    "Unsupported cuisine style: Use a standard cuisine category like italian, asian, american, mediterranean, or fusion.",
    "Invalid meal types: Select from breakfast, lunch, dinner, cocktail, dessert with at least one option.",
    "Guest count out of range: Provide a positive integer between 1 and 10000.",
    "Invalid budget tier: Choose from economy, standard, premium, or luxury."
  ],
  "usage": "Specify event_type, cuisine_style, meal_types array, and guest_count. Optionally set budget_tier. The tool generates a structured menu template with course categories and suggested dish types.",
  "output_details": {
    "template_id": {
      "type": "string",
      "description": "Unique identifier for the generated menu template"
    },
    "course_structure": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "List of course categories (appetizer, main, dessert, etc.)"
    },
    "suggested_dishes": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Recommended dishes for each course based on cuisine and event type"
    },
    "serving_style": {
      "type": "string",
      "description": "Recommended service format (buffet, plated, family-style, stations)"
    }
  }
}