{
  "tool_name": "Backup Scheduler",
  "tool_description": "Schedules and manages automated backups for files based on policies, ensuring data preservation and recovery capabilities.",
  "parameters": {
    "file_id": {
      "type": "string",
      "required": true,
      "description": "Unique identifier of the file to schedule for backup"
    },
    "backup_frequency": {
      "type": "string",
      "required": true,
      "description": "Backup frequency: hourly, daily, weekly, monthly, or custom"
    },
    "retention_period": {
      "type": "integer",
      "required": true,
      "description": "Number of days to retain backups"
    },
    "backup_type": {
      "type": "string",
      "required": false,
      "description": "Type of backup: full, incremental, or differential",
      "default": "incremental"
    },
    "priority": {
      "type": "string",
      "required": false,
      "description": "Backup priority level: low, normal, or high",
      "default": "normal"
    }
  },
  "error_messages": [
    "File not found: The specified file_id does not correspond to an existing file.",
    "Invalid backup frequency: Backup frequency must be hourly, daily, weekly, monthly, or custom.",
    "Invalid retention period: Retention period must be a positive integer representing days.",
    "Invalid backup type: Backup type must be full, incremental, or differential.",
    "Invalid priority level: Priority must be low, normal, or high.",
    "Scheduling conflict: A backup schedule already exists for this file with conflicting parameters."
  ],
  "usage": "Provide file_id, backup_frequency, and retention_period as required parameters. Optionally specify backup_type and priority to customize the backup strategy. The tool creates a scheduled backup job with the specified parameters.",
  "output_details": {
    "backup_job_id": {
      "type": "string",
      "description": "Unique identifier for the created backup job"
    },
    "next_backup_time": {
      "type": "string",
      "format": "date-time",
      "description": "Scheduled time for the next backup execution"
    },
    "estimated_backup_size": {
      "type": "integer",
      "description": "Estimated size of backup in bytes"
    },
    "schedule_status": {
      "type": "string",
      "description": "Status of the backup schedule: active, pending, or paused"
    }
  }
}