{
  "tool_name": "Application Tracker Setup",
  "tool_description": "Configures application tracking and management settings for a job posting including screening questions, workflow stages, and automated responses.",
  "parameters": {
    "posting_id": {
      "type": "string",
      "required": true,
      "description": "Unique identifier of the job posting to configure tracking for"
    },
    "screening_questions": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": false,
      "description": "List of screening questions to ask applicants",
      "maxItems": 10,
      "default": null
    },
    "workflow_stages": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": false,
      "description": "Custom workflow stages for application processing",
      "default": null
    },
    "auto_response_enabled": {
      "type": "boolean",
      "required": false,
      "description": "Whether to send automatic confirmation emails to applicants",
      "default": true
    }
  },
  "error_messages": [
    "Invalid posting ID: The provided posting ID does not exist or is not accessible",
    "Too many screening questions: Maximum 10 screening questions allowed",
    "Invalid workflow stage: Workflow stages must be non-empty strings",
    "Configuration conflict: Some settings are incompatible with the job posting platform requirements"
  ],
  "usage": "Provide the posting ID from a distributed job posting. Optionally configure screening questions, custom workflow stages, and automatic response settings. The tool sets up tracking and management for incoming applications.",
  "output_details": {
    "tracker_id": {
      "type": "string",
      "description": "Unique identifier for the application tracking configuration"
    },
    "tracking_url": {
      "type": "string",
      "description": "URL to access the application tracking dashboard"
    },
    "configured_stages": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Final list of workflow stages configured for this posting"
    },
    "screening_count": {
      "type": "integer",
      "description": "Number of screening questions configured"
    },
    "automation_status": {
      "type": "string",
      "description": "Status of automated features: enabled, partial, or disabled"
    }
  }
}