{
  "tool_name": "Conflict Check Runner",
  "tool_description": "Performs comprehensive conflict of interest checks against existing clients, opposing parties, and case databases to ensure ethical representation.",
  "parameters": {
    "client_name": {
      "type": "string",
      "required": true,
      "description": "Full legal name of the prospective client"
    },
    "opposing_parties": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": true,
      "description": "List of known opposing parties or entities involved in the case",
      "minItems": 1,
      "maxItems": 20
    },
    "case_type": {
      "type": "string",
      "required": true,
      "description": "Type of legal case (civil, criminal, corporate, family, etc.)"
    },
    "jurisdiction": {
      "type": "string",
      "required": true,
      "description": "Legal jurisdiction where the case will be handled"
    },
    "attorney_id": {
      "type": "string",
      "required": true,
      "description": "Unique identifier of the attorney handling the case"
    },
    "related_entities": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "required": false,
      "description": "Additional entities that may be related to the case",
      "default": "None"
    },
    "check_depth": {
      "type": "string",
      "required": false,
      "description": "Depth of conflict check: basic, standard, or comprehensive",
      "default": "standard"
    }
  },
  "error_messages": [
    "Client name required: Provide the full legal name of the prospective client",
    "Invalid case type: Use a recognized legal case type (civil, criminal, corporate, family, etc.)",
    "Invalid jurisdiction: Provide a valid legal jurisdiction",
    "Invalid attorney ID: Provide a valid attorney identifier from the system",
    "Invalid check depth: Use basic, standard, or comprehensive",
    "Opposing parties required: Provide at least one opposing party name"
  ],
  "usage": "Provide client name, opposing parties, case type, jurisdiction, and attorney ID. Optionally specify related entities and check depth. The tool will search for potential conflicts and return a detailed report.",
  "output_details": {
    "conflict_status": {
      "type": "string",
      "description": "Overall conflict status: clear, potential_conflict, or conflict_found"
    },
    "conflict_details": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "Detailed list of any conflicts or potential conflicts identified"
    },
    "clearance_level": {
      "type": "string",
      "description": "Level of clearance granted: full, conditional, or denied"
    },
    "check_timestamp": {
      "type": "string",
      "description": "Timestamp when the conflict check was performed"
    }
  }
}