{
  "tool_name": "DC Voltage Calibrator",
  "tool_description": "Performs DC voltage calibration measurements across specified ranges and test points, comparing DUT readings against reference standards and calculating measurement errors.",
  "parameters": {
    "voltage_ranges": {
      "type": "array",
      "required": true,
      "description": "DC voltage ranges to calibrate",
      "items": {
        "type": "string"
      },
      "minItems": 1,
      "maxItems": 10
    },
    "test_points_per_range": {
      "type": "integer",
      "required": false,
      "description": "Number of test points per range (minimum 5)",
      "default": 5
    },
    "measurement_cycles": {
      "type": "integer",
      "required": false,
      "description": "Number of measurement cycles for averaging",
      "default": 3
    },
    "settling_time": {
      "type": "integer",
      "required": false,
      "description": "Settling time in seconds between measurements",
      "default": 30
    }
  },
  "error_messages": [
    "Invalid voltage range: Specified voltage range is not supported by calibration system.",
    "Insufficient test points: Minimum 5 test points required per range for statistical validity.",
    "Reference standard overrange: Applied voltage exceeds reference standard capabilities.",
    "DUT reading unstable: Device reading varies beyond acceptable limits during measurement.",
    "Excessive measurement error: DUT error exceeds expected limits, possible malfunction.",
    "Settling time too short: Increase settling time for stable readings.",
    "Too many voltage ranges: Maximum 10 voltage ranges can be calibrated in single session."
  ],
  "usage": "Specify voltage ranges to calibrate and optionally adjust test points, measurement cycles, and settling time. Tool systematically applies reference voltages and measures DUT response.",
  "output_details": {
    "calibration_status": {
      "type": "string",
      "description": "Overall DC voltage calibration status"
    },
    "measurement_errors": {
      "type": "array",
      "items": {
        "type": "number"
      },
      "description": "Calculated measurement errors for each test point"
    },
    "ranges_tested": {
      "type": "array",
      "items": {
        "type": "string"
      },
      "description": "List of voltage ranges that were tested"
    },
    "max_error": {
      "type": "number",
      "description": "Maximum error found across all test points"
    },
    "within_specification": {
      "type": "boolean",
      "description": "Whether all measurements are within specification limits"
    }
  }
}